#!/usr/bin/env bash

# ==============================================================================
# VpsScriptKit - x-ui 面板安装与管理逻辑
#
# @文件路径: modules/node/xui/xui.sh
# @功能描述: 负责 x-ui 面板的一键安装
# @项目地址: https://github.com/mhsanaei/3x-ui
#
# @作者: Jamison
# @版本: 1.0.0
# @创建日期: 2026-01-09
# ==============================================================================

# ------------------------------------------------------------------------------
# 函数名: install_x_ui
# 功能:   执行 x-ui 官方脚本安装逻辑
#
# 参数:
#   无
#
# 返回值:
#   无
#
# 示例:
#   install_x_ui
# ------------------------------------------------------------------------------
install_x_ui() {
    print_clear

    print_info -m "正在准备安装伊朗版 3X-UI 面板一键脚本..."
    
	exec bash <(curl -Ls https://raw.githubusercontent.com/oliver556/x-ui/main/install.sh)
}