#!/usr/bin/env bash

# ==============================================================================
# VpsScriptKit - 3x-ui 面板管理模块
# 
# @文件路径: modules/node/3xui/3xui.sh
# @功能描述: 负责 3x-ui 面板的一键安装
# @项目地址: https://github.com/mhsanaei/3x-ui
# 
# @作者:    Jamison
# @版本:    1.0.0
# @创建日期: 2026-01-09
# ==============================================================================

# ------------------------------------------------------------------------------
# 函数名: install_3x_ui
# 功能:   执行 3x-ui 官方脚本安装逻辑
#
# 参数:
#   无
#
# 返回值:
#   无
#
# 示例:
#   install_3x_ui
# ------------------------------------------------------------------------------
install_3x_ui() {
    ui clear

    ui_info "正在准备安装伊朗版 3X-UI 面板一键脚本..."
    
	exec bash <(curl -Ls https://raw.githubusercontent.com/mhsanaei/3x-ui/master/install.sh)
}