#!/usr/bin/env bash

# ==============================================================================
# VpsScriptKit - lib/utils.sh
#
# @文件路径: [相对路径]
# @功能描述: 负责 “算” (字符串处理、路径计算、数学运算)
# @项目地址: [如果是第三方]
#
# @职责:
# 1. 提供模块通用功能函数
# 2. 支持系统判断、输入验证、等待、路径处理等
# 3. 不包含业务逻辑
#
# @作者: Jamison
# @版本: 0.1.0
# @创建日期: 2025-12-31
# ==============================================================================

# ------------------------------
# 输入校验
# ------------------------------

# TODO 后续删掉
is_number() {
  # 参数 $1：输入值
  # 返回 0 表示是纯数字，1 表示不是
  [[ "$1" =~ ^[0-9]+$ ]]
}

# ------------------------------------------------------------------------------
# 函数名: current_time
# 功能:   获取当前日期时间函数
# 
# 参数: 无
# 
# 返回值: 无
# 
# 示例:
#   current_time
# ------------------------------------------------------------------------------
current_time() {
  # 当前时间，格式: YYYY-MM-DD HH:MM:SS
  date "+%Y-%m-%d %H:%M:%S"
}

# ------------------------------------------------------------------------------
# 函数名: command_exists
# 功能:   命令存在性检查
# 
# 参数:
#   $1 (string): 命令名称 (必填)
# 
# 返回值:
#   0 - 存在该命令
#   1 - 不存在该命令
# 
# 示例:
#   command_exists
# ------------------------------------------------------------------------------
command_exists() {
  # 参数 $1：命令名
  local cmd="$1"

  # 使用 type 命令判断是否存在
  if type "$cmd" >/dev/null 2>&1; then
    return 0
  else
    return 1
  fi
}

# ------------------------------------------------------------------------------
# 函数名: get_docker_status_text
# 功能:   辅助函数: 获取 Docker 环境状态字符串
# 
# 参数:
#   无
# 
# 返回值:
#   0 - 已安装
#   1 - 未安装
# 
# 示例:
#   get_docker_status_text
# ------------------------------------------------------------------------------
get_docker_status_text() {
  if check_docker; then
    ui echo "${BOLD_GREEN}已安装${RESET}"
  else
    ui echo "${BOLD_RED}未安装${RESET}"
  fi
}

# 修复 dpkg 中断状态（防止清理失败）
fix_dpkg() {
    # 1. 礼貌停止：尝试让 apt/dpkg 正常保存数据并退出
    # (killall 默认发送 SIGTERM 信号，给进程机会收尾)
    killall apt apt-get dpkg 2>/dev/null
    ui_tip "等待后台任务释放..."
    sleep 3

    # 2. 强制清场：如果礼貌停止后进程还在（卡死了），再强制杀掉
    # (这一步是防止上面的 killall 没杀掉，导致后面删锁时发生冲突)
    pkill -9 -f 'apt|dpkg' 2>/dev/null

    # 3. 清理锁文件：这时候由于进程肯定没了，如果是异常退出的，锁文件可能还在，手动删掉
    rm -f /var/lib/dpkg/lock-frontend /var/lib/dpkg/lock /var/lib/apt/lists/lock

    # 4. 修复环境：处理刚才可能中断的安装包
    DEBIAN_FRONTEND=noninteractive dpkg --configure -a

    # 5. 执行更新：此时环境已经干净且修复完毕
}