#!/usr/bin/env bash

# ==============================================================================
# VpsScriptKit - 开放所有端口
#
# @文件路径: modules/system/network/open_all_ports.sh
# @功能描述: 开放 vps 所有端口
#
# @作者: Jamison
# @版本: 1.0.0
# @创建日期: 2026-01-23
# ==============================================================================

# ------------------------------------------------------------------------------
# 函数名: ssh_change_ssh_port
# 功能:   修改 SSH 端口前的前置检查
# 
# 参数:
#   无
# 
# 返回值:
#   0 - 可以执行修改
#   1 - 不满足条件（非 root / sshd 不存在）
# 
# 示例:
#   ssh_change_ssh_port
# ------------------------------------------------------------------------------
guard_open_all_port() {
    if ! check_root; then
        return 1
    fi

    open_all_port
}

# ------------------------------------------------------------------------------
# 函数名: open_all_port
# 功能:   开放所有端口
# 
# 参数:
#   无
# 
# 返回值:
#   0 - 所有端口开放成功
#   1 - 所有端口开放失败
#   2 - 用户取消操作
# 
# 示例:
#   open_all_port
# ------------------------------------------------------------------------------
open_all_port() {
    print_clear
    

    while true; do
        print_clear
        
    done
}
